Revit 2026 API

# CategoryParent Property

---

Returns the parent category of this category.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Category Parent { get; }
```
```vb
Public ReadOnly Property Parent As Category
	Get
```
```cpp
public:
property Category^ Parent {
	Category^ get ();
}
```
```fsharp
member Parent : Category with get
```

#### Return Value

Category if this category a not a subcategory

#### Reference

Category Class

Autodesk.Revit.DB Namespace